---
kind: other
id: Methods.T:Autodesk.Revit.DB.ICentralLockedCallback
source: html/8b29533e-109a-3ba2-1f4d-b6b33fc5dd96.htm
---
# ICentralLockedCallback Methods

Returns whether Revit should wait and try again to acquire the lock on central.